---
type: SlabShapeCrease
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# SlabShapeCrease

`Autodesk.Revit.DB.SlabShapeCrease` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CreaseType | — | `public SlabShapeCreaseType CreaseType { get ; }` |
| Property | Curve | — | `public Curve Curve { get ; }` |
| Property | EndPoints | — | `public SlabShapeVertexArray EndPoints { get ; }` |